W7D2/music_app/app/models/user.rb

UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "Tnq7f8H77Zitbyv39au7Fg"], ["id", 3]]
---
    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64
        self.save!